1939=morrison=catharine=gould__biography_draft.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-16 Mon 14:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Catharine (Kate) Lydia Morrison nee Gould, 1846-1939</title>
<meta name="author" content="George M Jones" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<h1 class="title">Catharine (Kate) Lydia Morrison nee Gould, 1846-1939</h1>
          <p class="subtitle"></p>
          <br>
          <p class="subtitle">George M Jones</p>
          <p class="subtitle"><a href="mailto:gmj@pobox.com">gmj@pobox.com</a></p>
          <p class="subtitle">2026-02-19 Thu 14:46</p>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org08addd6">1. Catharine (Kate) Lydia Morrison nee Gould, 1846-1939</a>
<ul>
<li><a href="#org10f1003">1.1. What's in a name?</a></li>
<li><a href="#org35a44c4">1.2. Intro</a></li>
<li><a href="#orgd40772d">1.3. Artifacts</a></li>
<li><a href="#org9d472a3">1.4. Family Bibles, Genealogies</a></li>
<li><a href="#orgffdee7f">1.5. Keepsake Box</a></li>
</ul>
</li>
<li><a href="#org72075c9">2. Writings</a>
<ul>
<li>
<ul>
<li><a href="#orgc9f4fa6">2.0.1. 1921 letter to Columbus Dispatch about Underground Railroad Activity</a></li>
<li><a href="#orgb832ca4">2.0.2. Dry Run Church Mission Society Minutes</a></li>
<li><a href="#org7a80902">2.0.3. Newspaper article about her 90th birthday</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
NOTE: This is mostly collection of material to write from.  It is very raw.   Not effort has been made yet to put this into narrative form.  I have a large number of artifacts from her in my house, even in my living room to this day.
</p>


<p>
These are mostly top-of-the-head memories George Jones has of stories about family members, ancestors, artifacts, etc.  These are things I've been told.   There are probably inaccuracies, omissions, embellishments, one-sided stories, etc.  The stories are mostly arranged by person.  Where I have artifacts related to the person, I mention them.   As I know of or have reasonable grounds to speculate on financial situations I do.    With every generation incalculable amounts of information is lost.  With these write-ups, I'm making a small attempt at stanching the flow.   My primary audience is my own family.   My hope is these articles will give you a little more idea where you came from, what sorts of trials your family has faced and how we were a part of the larger flow of human events.
</p>
<div id="outline-container-org08addd6" class="outline-2">
<h2 id="org08addd6"><span class="section-number-2">1.</span> Catharine (Kate) Lydia Morrison nee Gould, 1846-1939</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org10f1003" class="outline-3">
<h3 id="org10f1003"><span class="section-number-3">1.1.</span> What's in a name?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Pick a name, any name&#x2026; 
</p>

<p>
"Kate Morrison" seems to be the name most used informally (church meeting minutes,
etc). Her tombstone reads "Catharine L. Morrison", and I also have "Catharine Morrison"
in what I think is her own handwriting (the cover to a 1936 Methodist Hymnal), but
there are numerous references to "Catherine". She was also known as Lydia Catharine
(not Catharine Lydia), which is what was in my head and also noted as a variant by
John Bowdle in his genealogy records. Her 1921 letter to the Columbus Dispatch describing
underground railroad activity in her home community of Lower Salem/Duck Creek was
signed "Mrs. E.F. Morrison". And of course she was born a Gould. Her own father,
Ephriam Gould, who's spelling was atrocious, referred to her as "Catherine" and "Cate"
in his account book.
</p>

<p>
Maybe the moral is "Don't give you kids names with uncommon spellings", like "Bryan".
</p>

<p>
The ambiguity continued with her oldest child.  Per Philip Morrison (her nephew):
</p>

<blockquote>
<p>
"Aunt Myrta &#x2013;that was what she was called. It was always pronounced as
Myrtie. I think her given name was Martha."
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org35a44c4" class="outline-3">
<h3 id="org35a44c4"><span class="section-number-3">1.2.</span> Intro</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Yesterday (2026-01-18) I (George Morrison Jones) stopped at Lower Salem, Ohio on my way home from Columbus/London.  I drove down I-77 on a lark just to go a different way and saw "Lower Salem" on an exit sign, so I went.  I had last been there in the 90s with Mom, Dad, Bryan and Steph.  The 13 (or 17) year locusts were out then.
</p>

<p>
She was born in 1846, likely at the Gould farm just down the hill from "Gould's Church" a.k.a. "Mount Ephraim" in Washington County, Ohio (9 Hedrick Rd, Lower Salem, OH 45745) on "Duck Creek".   She died in 1939 at the Morrison farm in Union Township, Ross County Ohio on the Allbright-Mill Rd.  She married Elisha Ford Morrison April 2, 1868 in Washington County &#x2026; inference, it had to be at "Mount Ephraim".    Per John Bowdle's records, she had attended Mt. Union College prior to marriage and had been a teacher &#x2026;women attending college in the 1860s was, I think, not common.  Education seems to have been important in much of our family.  "Aunt Myrte" ("Myrta") was born December 24 in Ross county, so they had to have moved up soon after marriage.   I think most/all of the Morrison clan moved up to what is now the "Morrison Road" in Union Township about that time, including his father Maurice/"Morris" Morrison and "Uncle Billy".  The Bowdles had already been there almost 70 years (1800).
Elisha had served in the Civil War.
</p>

<p>
Myrta Morrison born December 24, 1868 in Union Township, Ross County, Ohio.   The story (from the John Bowdle, her grandson) was that they lived in a log cabin on the Morrison road and that she remembered walking over the hill behind the wagon when they moved to the Morrison Farm (Now 373 Albright Mill Rd).  The rest of her siblings (including my grandfather George Morrison) where all born at the farm.  She would later marry into the Bowdle family and move back over the hill.
</p>

<p>
I was told Grandpa (George Morrison) remembered seeing an old log cabin in his youth that had gun-slits in it to shoot out of to protect from Indians.  My memory says I was told it was on the hill next to the Bowdle-Morrison cemetery off the Bowdle Road.  Maybe this is a conflation with the cabin Myrta was born on ?on the Morrison Road?.
</p>
</div>
</div>
<div id="outline-container-orgd40772d" class="outline-3">
<h3 id="orgd40772d"><span class="section-number-3">1.3.</span> Artifacts</h3>
<div class="outline-text-3" id="text-1-3">
<p>
I have quite a few artifacts in my house that belonged to Kate Morrison or were associated with her.
I think this is just an consequence of the way households have been broken up over the past 150 years when people died.  This stuff, and some of the associated stories, have just come to me.
</p>

<dl class="org-dl">
<dt>1936 Methodist Hymnal</dt><dd><p>
I have her 1936 Methodist hymnal.  She signed and dated it: "Mrs. Catharine Morrison, April 2, 1936".   About 6 weeks after my mother (Lois Morrison, named for her mother) was born.
Apparently singing was so important that at the age of 90 she got a new hymnal.
</p>

<p>
And here we have another spelling/name controversy.  If she wrote her own name in that hymnal, as I think likely, she spelled Catharine with an "a".  It is also written this way in the death record in the Morrison family bible.  In the Gould family bible the marriage name is recorded as "Kate L. Gould".
Names were fluid  back then.
</p>

<dl class="org-dl">
<dt>Ephriam Gould's cain</dt><dd>I have Ephriam Gould's cain.  My guess is the family member that was caring for him in his last days (daughter Anna ?) kept it, and it has simply come down the generations to me.</dd>

<dt>Clock</dt><dd>I have the wind-up clock that she got when she "set up housekeeping" in 1868.  Grandma (Esther Morrison) had it repaired in the 1970s.  It works fine.  It chimes on the hour.   You have to wind it, adjust the speed and correct the time now and then.  It's analog.</dd>

<dt>Cookbook and Housekeeping Guide</dt><dd>"Bad dinners go hand in hand with total depravity, while a properly fed man is already half saved".  No really.  Not making this up.  This was combined theological, culinary and domestic advice given by the "Buckeye Cookery and Practical Housekeeping" book of 1877.  Later sections dealt the "the help" implying that "the girls" you hire are always unreliable, lazy and out bilk you.
Grandma (Esther Morrison) was hired in as "help".   Hope this advice went unread.  Grandma was the hardest worker I've seen in my life and was at times obsessive about neatness, perfect designs on pie crusts, etc.
There is an insert in the front saying the book was written by and for women and sold by women agents and soliciting new agents to sell to their friends.  Multilevel Marketing 19th century style.  "Avon calling".</dd>

<dt>Large walnut cabinet and dates</dt><dd><p>
I have a walnut cabinet.  The note inside says
</p>

<blockquote>
<p>
1865 Walnut Cabinet.
</p>

<p>
This walnut cabinet was made in 1865 in Union Township, Ross County, Ohio, by Mr. Shetstone of Marietta, Ohio, a carpenter who traveled to Union Township specifically to make this one cabinet for Morris Morrison
</p>

<p>
Two Whetstone brothers were carpenters, and it is not know which one made the cabinet.  Information obtained Christmas Day, 1969, from Mr. George L. Morrison (grandson of Morris), of 369 Franklin Court, Worthington, Ohio 43085.
</p>
</blockquote>

<p>
When I was at Mt. Ephriam this week I noted that there were about 10 Whetstone's in the graveyard,
so, "Marietta" in this case almost certainly meant "Duck Creek"/Lower Salem. 
</p>

<p>
I think the Morrisons moved from Lower Salem/Duck Creek to Union Township, Ross County in early 1866.
This is based on the fact that Ephriam Gould's farm financial records (which I have) listed fairly regular transactions with Morris Morrison (Ephriam's Father), and the last one listed as March 1866. 
</p></dd>
</dl>

<p>
If dates are correct, it puts the move of at least part of the Morrison family to Ross County three years before the marriage of Kate and Elisha in Washington County. It also puts an upper bound of 1969 on the sale of the Morrison farm in Ross County as the proceeds would have been needed to buy the house on Franklin Ct. Since Myrta remembered walking to the farm behind the wagon, it's purchase could not have been much before 1870, putting the Morrison family on the Albrigh Mill Road around 98 years. Uncle Ernie was, I think, the only one to live his whole life there.
</p>

<p>
The cabinet likely started life in the Morris Morrison farm on the Morrison Road,
and at some point moved to the E.F. Morrison farm on the Albright Mill Rd.
After that (1969 to 1996) it was in
our house in Flint Road and moved with Mom (Lois Jones) to their house on McGregor.
I think it moved here (our hours in Virginia) in 2003, so in 150 years it has likely
only moved 5 times.
</p></dd>
</dl>
</div>
</div>
<div id="outline-container-org9d472a3" class="outline-3">
<h3 id="org9d472a3"><span class="section-number-3">1.4.</span> Family Bibles, Genealogies</h3>
<div class="outline-text-3" id="text-1-4">
<p>
I have two large family bibles.   I think one is Gould family and the other Morrison.  The both have hand-written birth, death and Marriage records, one as far back as the late 18th century.  They are still kept current.
</p>
</div>
</div>
<div id="outline-container-orgffdee7f" class="outline-3">
<h3 id="orgffdee7f"><span class="section-number-3">1.5.</span> Keepsake Box</h3>
<div class="outline-text-3" id="text-1-5">
<p>
I have Kate Morrison's keepsake box.   Some of the contents were distributed to various memebers of our (Jones) family on the death of Lois Morrison Jones, per her written instructions.   Prior to that at least,
it contained a multitude of items ranging from Civil War reunion medals, to the 1880's records of the sale of windows used to add a 2nd story to the Morrison Farm, to the deeds to the farm, etc. 
</p>
</div>
</div>
</div>
<div id="outline-container-org72075c9" class="outline-2">
<h2 id="org72075c9"><span class="section-number-2">2.</span> Writings</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc9f4fa6" class="outline-4">
<h4 id="orgc9f4fa6"><span class="section-number-4">2.0.1.</span> 1921 letter to Columbus Dispatch about Underground Railroad Activity</h4>
<div class="outline-text-4" id="text-2-0-1">
<p>
I have a copy of a 1921 letter she wrote to the Columbus Dispatch describing anti-slavery/underground railroad activity in her home community.  There is a barn (still standing, 2026) on what as the Gould farm just down
the hill from Mt. Ephriam church that was built by one of the Morrisons for Ephriam Gould.  The letter details Ephriam Gould hiding run-away slaves in the barn and refusing entry to the slave catchers (property rights, dontcha know?).  Lower Salem was just 16 miles north of the Marietta and the Ohio River and the Gould farm was just a few miles out of town.  It was likely the 2nd stop on the way to Canada north of the Ohio river in that area.
</p>
</div>
</div>
<div id="outline-container-orgb832ca4" class="outline-4">
<h4 id="orgb832ca4"><span class="section-number-4">2.0.2.</span> Dry Run Church Mission Society Minutes</h4>
<div class="outline-text-4" id="text-2-0-2">
<p>
I am in possession of constitution and minutes of the Dry Run Womens Foreign Mission Society which seems to have been active 1871 to 1904.  "Kate Morrison" is listed as a member most of that time.  Her sister Anna Gould ("Auntie") was secretary most of that time.  The same notebook had originally been the constitution and minutes of the "Union Soldiers Aid Society", 1863-1864 with much overlapping membership, though the Morrisons/Goulds apparently moved up from Noble/Washington County right after the war.  E.F. Morrison had been a Union soldier from a unit in Noble county.
</p>
</div>
</div>
<div id="outline-container-org7a80902" class="outline-4">
<h4 id="org7a80902"><span class="section-number-4">2.0.3.</span> Newspaper article about her 90th birthday</h4>
</div>
</div>
</div>
</body>
</html>
